let wordBank = [
    'अकबर',
    'अचकन',
    'अजगर',
    'अटकल',
    'अदरक',
    'अनपढ़',
    'अनबन',
    'अफसर',
    'अरहर',
    'उपवन',
    'उबटन',
    'उलझन',
    'कटहल',
    'करतब',
    'करवट',
    'कलकल',
    'कसरत',
    'खटमल',
    'गरदन',
    'चमचम',
    'जगमग',
    'जबतब',
    'जमघट',
    'झटपट',
    'टसमस',
    'तड़पन',
    'तरकश',
    'दमकल',
    'दमखम',
    'दसरथ',
    'दहशत',
    'धड़कन',
    'नटखट',
    'पतझड़',
    'पनघट',
    'परवल',
    'पलटन',
    'पलभर',
    'बचपन',
    'बरगद',
    'भगदड़',
    'भगवन',
    'भरकर',
    'मखमल',
    'मतलब',
    'मरघट',
    'मरहम',
    'वनचर',
    'शरबत',
    'शलगम',
    'सरगम',
    'सरपट',
    'हड़बड़',
    'हरकत',
    'हरदम',
    'हलचल'
];

function getRandomWords() {

    const selected = new Set();
    
    while(selected.size < 4) {
        const randomIndex = Math.floor(Math.random() * wordBank.length);
        selected.add(wordBank[randomIndex]);
    }

    return Array.from(selected).join('').split('');
}