const preMatra = ['्', 'ा', 'ु', 'ू', 'ि', 'ी', 'ो', 'ौ', 'े', 'ै', 'ं', 'ः', '़'];
const postMatra = ['्'];

let wordBank33 = [
    'पगली',
    'नौकरी',
    'दावत',
    'बादल',
    'पलट',
    'भरम',
    'दीवार',
    'नकली',
    'मोरनी',
    'पहल',
    'बिहार',
    'सजग',
    'जगत',
    'चुराई',
    'ताकत',
    'गाजर',
    'छोकरी',
    'सदन',
    'केवल',
    'विषय',
    'मोहन',
    'सदर',
    'कसम',
    'मालिक',
    'रजत',
    'सरस',
    'बेहद',
    'विजेता',
    'विवेक',
    'बहुत',
    'विलीन',
    'नकल',
    'संतान',
    'दीवाली',
    'तरस',
    'सहज',
    'दीपक',
    'विवाद',
    'विलय',
    'सेहत',
    'जोगन',
    'चमन',
    'परत',
    'वीराना',
    'शहर',
    'विराट',
    'मगर',
    'आदमी',
    'यौवन',
    'गरज',
    'मशीन',
    'सिवाय',
    'सनम',
    'कसक',
    'सलाम',
    'अगर',
    'वीरान',
    'बयान',
    'विवाह',
    'राहत',
    'सनद',
    'चुराया',
    'कहना',
    'विकास',
    'पकड़',
    'नगर',
    'नौबत',
    'सलाह',
    'बादाम',
    'सोहन',
    'जामुन',
    'बेलन',
    'विजय',
    'चाकरी',
    'चुराए',
    'विधान',
    'सुजान',
    'कलम',
    'दवात',
    'यमुना',
    'तेवर',
    'औरत',
    'नरम',
    'उजला',
    'बदल',
    'नवीन',
    'पसली',
    'किसान',
    'नहर',
    'पहाड़',
    'मछली',
    'जहाज',
    'नवल',
    'विनय',
    'दवाई',
    'माधवी',
    'कीमत',
    'सड़क',
];

let wordBank44 = [
    'अनपढ़',
    'दहशत',
    'पलभर',
    'पैदावार',
    'सरकार',
    'उबटन',
    'प्रावधान',
    'जमघट',
    'दमकल',
    'अखबार',
    'हड़ताल',
    'वितरण',
    'तरकश',
    'गरदन',
    'करवट',
    'नियोजन',
    'फुलवारी',
    'वनचर',
    'मरघट',
    'भगवन',
    'अकबर',
    'मतलब',
    'सोमवार',
    'रूपरेखा',
    'नटखट',
    'मलहम',
    'राजभाषा',
    'तड़पन',
    'पतझड़',
    'शरबत',
    'निराधार',
    'हरकत',
    'कालातीत',
    'मरहम',
    'भरकर',
    'टसमस',
    'समूहिक',
    'अरहर',
    'बुलेटिन',
    'मखमल',
    'दसरथ',
    'सरपट',
    'विभागीय',
    'उपवन',
    'सराहना',
    'अफ़सर',
    'शलगम',
    'शुक्रवार',
    'वसीयत',
    'समझना',
    'पहचान',
    'भगदड़',
    'समझौता',
    'विवादित',
    'अजगर',
    'रोजगार',
    'अदरक',
    'बचपन',
    'परिवार',
    'हड़बड़',
    'खटमल',
    'गड़बड़ी',
    'दुराचार',
    'विज्ञापन',
    'धड़कन',
    'रविवार',
    'सहमति',
    'विवरण',
    'झटपट',
    'पनघट',
    'पलटन',
    'अफसर',
    'अनबन',
    'दिनकर',
    'अचकन',
    'सेवाकाल',
    'उलझन',
    'परवल',
    'जगमग',
    'सरगम',
    'हरदम',
    'गुरूवार',
    'पारिजात',
    'जागरूक',
    'किफायती',
    'हलचल',
    'चमचम',
    'इतवारी',
    'साधारण',
    'अटकल',
    'अभिषेक',
    'कसरत',
    'बहीखाता',
    'जबतब',
    'कलकल',
    'शनिवार',
    'शिकायत',
    'बुधवार',
    'बरगद',
    'दमखम',
    'वकालत',
    'करतब',
    'जानवर',
    'कटहल',
];

let wordBank44La = [
    'प्रावधान',
    'मध्यस्थ',
    'व्यवहार',
    'प्रचलित',
    'व्यवधान',
    'कल्पनीय'

];


function getRandomWords() {

    const d1 = new Date('2024-12-16');
    const d2 = new Date().setHours(0, 0, 0);

    let idx = Math.abs(Math.round((d2 - d1) / 864e5)) * 4;

    const selected = new Set();

    let items = gridN > 3 ? [...wordBank44] : [...wordBank33];


    while (selected.size < gridN) {
        //const randomIndex = Math.floor(Math.random() * items.length);
        selected.add(items[idx]);
        idx++;
    }

    let allChars = Array.from(selected).join('').split('');

    return formatComplexWords(allChars);
}

function formatComplexWords(allChars) {

    let outText = [];

    for (let i = 0; i < allChars.length; i++) {
        if (postMatra.includes(allChars[i])) {
            let t1 = outText.pop();
            let c1 = ([t1, allChars[i], allChars[i + 1]]).join('');
            outText.push(c1);
            i++;
        } else if (preMatra.includes(allChars[i])) {
            let t2 = outText.pop();
            let c2 = ([t2, allChars[i]]).join('');
            outText.push(c2);
        } else {
            outText.push(allChars[i]);
        }
    }
    return outText;
}